//detail.js
var app = getApp();
Page({
  data: {
    ListJson:[],
    list:[{
      id:0,
      title:"感恩一路有你，光大积分大回馈",
      src:"https://xyk.cebbank.com/upload/portal/201611/28289.jpg",
      actTime:"2016年11月22日-24日",
      activities:"我行信用卡客户",
      actCont:"活动期间，可计积分交易累计金额满2999元及以上送2万积分。按交易时间，限前8万名客户且每人限1次。",
      actRule:[
          '1.本活动以客户为单位进行统计，副卡交易视同主卡客户交易，所获奖励积分直接计入主卡账户。',
          '2.客户名下多张信用卡将合并统计。',
          '3.刷卡交易时间以中国光大银行信用卡系统记录的银行记账时间为准。',
          '4.如在活动期间发生撤销交易，则所撤销的交易金额不计入本次活动统计范围。',
          '5.如用户出现违规行为（如虚假交易，套现等），将撤销活动参与资格，并回收获奖积分。',
          '6.奖励积分将在活动结束后20个工作日内添加至客户积分账户。',
          '7.有关积分奖励的细则及条款请参见：中国光大银行信用卡网站-最新公告-积分奖励计划细则及条款。',
          '8.本活动可与其他积分活动同享。'
      ]
    },{
      id:1,
      title:"感恩一路有你，光大积分大回馈",
      src:"https://xyk.cebbank.com/upload/portal/201611/28289.jpg",
      actTime:"2016年11月22日-24日",
      activities:"我行信用卡客户",
      actCont:"活动期间，可计积分交易累计金额满2999元及以上送2万积分。按交易时间，限前8万名客户且每人限1次。",
      actRule:[
          '1.本活动以客户为单位进行统计，副卡交易视同主卡客户交易，所获奖励积分直接计入主卡账户。',
          '2.客户名下多张信用卡将合并统计。',
          '3.刷卡交易时间以中国光大银行信用卡系统记录的银行记账时间为准。',
          '4.如在活动期间发生撤销交易，则所撤销的交易金额不计入本次活动统计范围。',
          '5.如用户出现违规行为（如虚假交易，套现等），将撤销活动参与资格，并回收获奖积分。',
          '6.奖励积分将在活动结束后20个工作日内添加至客户积分账户。',
          '7.有关积分奖励的细则及条款请参见：中国光大银行信用卡网站-最新公告-积分奖励计划细则及条款。',
          '8.本活动可与其他积分活动同享。'
      ]
    },{
      id:2,
      title:"AMAZON黑五购物满额免邮",
      src:"https://xyk.cebbank.com/upload/portal/201611/28286.jpg",
      actTime:"本次活动开始时间为2016年11月21日上午07:00，截止时间为2016年11月29日晚上23:59（均为北京时间）。",
      activities:"",
      actCont:"使用中国光大银行Visa信用卡，在美国亚马逊网站购买直邮中国的商品，输入代码享受以下优惠：<br>VISACHINA1：购买鞋子类、服装类、个人电脑类（任一或累计）满150美元（不含税），减免此三类商品的运费（适用于整个活动期间）；<br>VISACHINA2：购买金额满150美元（不含税），减免全单运费（每天数量有限，先到先得）。",
      actRule:[
          '1.“运费”指亚马逊网站的“标准运费” （AmazonGlobal standard shipping）。',
          '2.交易金额需满150美元；不包运费、税费、礼品包装费等。',
          '3.在结算过程中需使用中国光大银行Visa信用卡支付，并在“Review your order”（“审查订单”）页面中输入活动代码，并且选择AmazonGlobal Standard Shipping（标准运费）；如果交易满足条件，系统会直接扣减运费。',
          '4.优惠仅适用于美国亚马逊网站销售和直运至中国大陆的全球购商品。电子文档、Kindle阅读器和配件、礼品卡不属此次活动商品范围。',
          '5.每个帐户只能享受一次优惠，且邮寄地址在中国大陆。',
          '6.如果使用本优惠的商品发生退货，亚马逊将根据相关退款政策执行。',
          '7.如违反本活动的任何条款或条件，优惠将无效。',
          '8.若有法律禁止则无效。',
          '9.优惠不允许转让或转售。具体活动细则请详询VISA官网。',
          '10.Amazon保留在任何时候修改和取消优惠的权利。',
          '11.您还可登录www.visa.com.cn 或 www.amazon.com/global/visa查询。'
      ]
    },{
      id:3,
      title:"光大白金，百元优享系列洗车",
      src:"https://xyk.cebbank.com/upload/portal/201611/28293.jpg",
      actTime:"2016年11月21日至2016年12月31日",
      activities:"中国光大银行银联标识白金、钻石（尊尚）及无限等级信用卡客户",
      actCont:"2016年11月21日至12月31日期间，登陆“阳光惠生活APP”使用中国光大银行银联标识白金、钻石（尊尚）及无限等级信用卡（非VISA、JCB、万事达单标卡）支付100元，即可获得12次标准洗车权益或8次品质洗车权益。标准洗车权益每月限前2500个名额，品质洗车权益每月限前1500个名额。",
      actRule:[
          '1.本活动仅支持使用中国光大银行银联标识白金、钻石（尊尚）及无限等级信用卡（非VISA、JCB、万事达单标卡）通过“阳光惠生活”APP及活动详情页面购买权益。',
          '2.每位客户活动期间限参与一次活动，标准洗车和品质洗车权益不可重复购买。',
          '3.标准洗车权益每月限前2500个名额，品质洗车权益每月限前1500个名额，先买先得。',
          '4.权益以码券形式发放，客户活动详情页面中查看状态。码券自购买当月起，每月可使用两张，有效期截至2017年10月31日。',
          '5.请客户在洗车前告知门店工作人员使用光大银行信用卡洗车权益,并将绑定手机号告知工作人员，收到动态密码并交由工作人员核验无误后方可使用洗车权益。',
          '6.标准洗车权益仅限在普通洗车活动门店使用，品质洗车权益适用于全国四星级及以上的品质连锁洗车门店，具体适用范围以码券对应的活动门店列表为准。',
          '7.洗车车型仅限 7 座及以下的小轿车和 SUV，不包括MPV非运营车辆。',
          '8.商品服务由洗车门店提供。如有疑问或投诉，请致电客服热线400-6666-377。',
      ]
    }
    ],        
  },
  onLoad: function (option) {
    console.log(option);
    var id = Number(option.id);
    var len = this.data.list;
    for(var i = 0 ; i < len.length ; i++ ){
      if(len[i].id == id){
        this.setData({
          ListJson:len[i]
        })
        console.log(this.data.ListJson);
      }
    }
    //显示导航条
    wx.setNavigationBarTitle({
      title: '当前页面'
    });
    //加载动画
    wx.showNavigationBarLoading();
    //结束动画
    wx.hideNavigationBarLoading()
    //数据请求
/*    wx.request({
      url: "http://localhost:8080/pages/layout/test.json", //等待网络接口--接受json数据,处理后在发送
      data: {},
      header: {
          'content-type': 'application/json'
      },
      success: function(res) {
        console.log(res.data)
      },
      error:function(){
        console.log("报错")
      }
    })*/
  },
  //分享定义
  onShareAppMessage: function () {
    return {
      title: '分享',
      desc: '小程序分享',
      path: '/page/user?id=123'
    }
  }
})
